---
type: DefinitionBindingMap
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# DefinitionBindingMap

`Autodesk.Revit.DB.DefinitionBindingMap` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DefinitionBindingMap | — | `public DefinitionBindingMap ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( Definition key )` |
| Method | Erase | — | `public virtual int Erase ( Definition key )` |
| Method | ForwardIterator | — | `public virtual DefinitionBindingMapIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( Definition key , Binding item )` |
| Method | ReverseIterator | — | `public virtual DefinitionBindingMapIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual Binding this [ Definition key ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |